<details ><summary>plan for dev 2025-06-11 23:48:40 (UTC)</summary>
      <details ><summary>Locking successful</summary>
  Project diggerhq/states-test#dev has been locked by PR #5
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.example_secret will be created
  + resource "aws_ssm_parameter" "example_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Example secret parameter"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/example/secret/"
      + tags           = {
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (dev)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>